tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/constant/pyrolysisZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysis
{
    active          true;

    pyrolysisModel  reactingOneDim;

    region          pyrolysisRegion;

    reactingOneDimCoeffs
    {
        filmCoupled     true;

        gasHSource      true;
        QrHSource       false;

        radFluxName     Qr;

        moveMesh        false; // true;
        minimumDelta    1e-6;

        useChemistrySolvers    true;
    }
}


// ************************************************************************* //
